Hi @Junkern, Thanks for trying to reproduce.

This is my code : 

```
module "docker_image_lambda_kpi_generator" {
  source  = "terraform-aws-modules/lambda/aws//modules/docker-build"
  version = "7.20.1"

  create_ecr_repo  = true
  ecr_repo         = "${local.project_name}-kpi-gen-${var.env_name}"
  image_tag        = "${local.hash_lambda_kpi_generator}${local.hash_layer_utils}"
  docker_file_path = "lambdas/kpi_generator/Dockerfile"
  source_path      = "${path.module}/.."
  scan_on_push     = true

  triggers = { # rebuild only when one of this files changes
    dir_lambda = local.hash_lambda_kpi_generator,
    dir_layer  = local.hash_layer_utils
  }

  ecr_repo_lifecycle_policy = jsonencode({
    "rules" : [
      {
        "rulePriority" : 1,
        "description" : "Keep only the last 2 images",
        "selection" : {
          "tagStatus" : "any",
          "countType" : "imageCountMoreThan",
          "countNumber" : 2
        },
        "action" : {
          "type" : "expire"
        }
      }
    ]
  })
}
```

docker_image tries to replace every time even if I have no changes in my files. Here is my plan every time :

`
  # module.docker_image_lambda_kpi_generator.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "423671310539.dkr.ecr.eu-west-1.amazonaws.com/vwt-kpi-gen-dev:a845c24f0af573ffc0f6bed2fe6da82019690def608b93ba5984534e70e4b563a34ac9c23edd61b7"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_lambda" = "a845c24f0af573ffc0f6bed2fe6da82019690def"
          + "dir_layer"  = "608b93ba5984534e70e4b563a34ac9c23edd61b7"
        }
      + build {
          + cache_from   = []
          + context      = "./.."
          + dockerfile   = "lambdas/kpi_generator/Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = []
        }
    }
`
